load-test/attendee-api-prod-rest.yml
config:
  target: "https://attendees.events.q4inc.com/rest/v1"
  ensure:
    max: 10000 # fail if max response time exceeds 5000ms
    maxErrorRate: 4 # fail if error rate exceeds 0%
  phases:
    - duration: 300           # 5 min
      arrivalRate: 166        # 166 attendee's per second ~ 10k per minute
      rampTo: 333
      name: "Attendee rest load test 300-166->333-365301633-all"
scenarios:
  - name: "Perform Attendee http journey to console"
    flow:
      - get:
          url: "/flags"
      - get:
          url: "/event/365301633"
      - get:
          url: "/attendee/public/profile?authToken=eyJhbGciOiJSUzI1NiIsInR5cCI6IkpXVCIsImtpZCI6IkxZM1BIQzNVSFNZdVlVdGxZMTFuRyJ9.eyJodHRwczovL2NvbmZlcmVuY2UucTRpbmMuY29tL2Nvbm5lY3Rpb24iOiJRNEwtUHVibGljLVVzZXJzLUNvbm5lY3Rpb24iLCJuaWNrbmFtZSI6ImRteXRyby5rdWtoYXJlbmtvIiwibmFtZSI6ImRteXRyby5rdWtoYXJlbmtvQHE0aW5jLmNvbSIsInBpY3R1cmUiOiJodHRwczovL3MuZ3JhdmF0YXIuY29tL2F2YXRhci9iYTc0MjhhNWIyYTlmNTFjMWY2MGM4ZTViMjA5YjQyZD9zPTQ4MCZyPXBnJmQ9aHR0cHMlM0ElMkYlMkZjZG4uYXV0aDAuY29tJTJGYXZhdGFycyUyRmRtLnBuZyIsInVwZGF0ZWRfYXQiOiIyMDI0LTA3LTA0VDE3OjEyOjIyLjA0M1oiLCJlbWFpbCI6ImRteXRyby5rdWtoYXJlbmtvQHE0aW5jLmNvbSIsImVtYWlsX3ZlcmlmaWVkIjp0cnVlLCJpc3MiOiJodHRwczovL2xvZ2luLnE0aW5jLmNvbS8iLCJhdWQiOiJMeHdvQWJwZkRwY21wUm9TQVRYYjV1cVFDdzJ6T1RlTiIsImlhdCI6MTcyMDExNjg2NSwiZXhwIjoxNzI3ODkyODY1LCJzdWIiOiJlbWFpbHw2MmY2NTJmMWI0MjMwNjgxYjMzN2M5OTQiLCJzaWQiOiJVMVJwc2hEZ3NYMHR2Nmp2cU9OTXZONEtuMHdiaUhXZCIsIm5vbmNlIjoiU0VGaFNrNVBRVWM1TFV0dWNHbzRMbXRpT0V4Q1R6QlVjekZ3T1d3MlJ6a3dTMU55UTI5TmRXbHNjZz09In0.Q4XhsN8BKbjjB5k1lphit3YBuUo8FVZJgjJdSWWy-xQZ2_MGvZJifrh-dQtLWdp93ORzTkQNHnXVt1gH3DTYXqnJQjvq5GO1vFZRyR4iJrOyLmp6r0UMdtW-2RMC-x3B0aICwCxY7g02AgTnt7UoEtmbsmMoLgEszG4JheHtEjTXxNdK6X-jl8EVeeMe60uNDUS_PN22ytuafVgYBzCauIE_ppMU_r6CDj95g-6vB_tJSGy8QrGA2B_zrcnMTgaoycfvK3uq9hfCs7TpAgyps9uYyFfRP_EStGPBPeAz-Ru9aXovBkOOw_ZtMpCCPqIOmNweGO8PY1dC8fsSsiboqw"
      - think: 2
      - get:
          url: "/event/365301633"
      - get:
          url: "/flags"
      - get:
          url: "/auth/token/365301633"
      - post:
          url: "/attendee"
          headers:
          json:
            attendeeType: "GUEST"
            email: "{{ $randomString() }}@loading.com"
            firstName: "{{ $randomString() }}"
            investorType: "individual"
            lastName: "{{ $randomString() }}"
            meetingId: 365301633
            registrationType: "LOBBY"
            sendReminderEmail: true
            type: "Q4_LOGIN"
            wsConnectionId: "{{ $randomString() }}"
      - loop:
          - get:
              url: "/event/365301633/broadcast-status"
              headers:
          - think: 25
        count: 5
      - get:
          url: "/event/365301633/slides"
          headers: